{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "transformer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "dec_inputs"}, "name": "dec_inputs", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "enc_padding_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAczQAAAB0AGoBdABqAmoDfABkAYMCdABqBIMCfQF8AWQAZACF\nAnQAagV0AGoFZABkAIUCZgQZAFMAKQJO6QAAAAApBtoCdGbaBGNhc3TaBG1hdGjaBWVxdWFs2gdm\nbG9hdDMy2gduZXdheGlzKQLaAXjaBG1hc2upAHIKAAAA+h48aXB5dGhvbi1pbnB1dC0xLTc4ZjZm\nNjNlYmExOD7aE2NyZWF0ZV9wYWRkaW5nX21hc2uWAAAAcwQAAAAAARgC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, 1, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "enc_padding_mask", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8333, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul", "trainable": true, "dtype": "float32", "node_def": {"name": "mul", "op": "Mul", "input": ["embedding/Identity", "mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 16.0}}, "name": "tf_op_layer_mul", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "PositionalEncoding", "config": {"config": "as required"}, "name": "positional_encoding", "inbound_nodes": [[["tf_op_layer_mul", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["positional_encoding", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "encoder_layer_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["attention", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add", "trainable": true, "dtype": "float32", "node_def": {"name": "add", "op": "AddV2", "input": ["inputs_2", "dropout_1/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add", "inbound_nodes": [[["inputs", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["tf_op_layer_add", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "add_1", "op": "AddV2", "input": ["layer_normalization/Identity", "dropout_2/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_1", "inbound_nodes": [[["layer_normalization", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["tf_op_layer_add_1", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_1", 0, 0]]}, "name": "encoder_layer_0", "inbound_nodes": [[["dropout", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "encoder_layer_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["attention", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_2", "trainable": true, "dtype": "float32", "node_def": {"name": "add_2", "op": "AddV2", "input": ["inputs_3", "dropout_3/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_2", "inbound_nodes": [[["inputs", 0, 0, {}], ["dropout_3", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_2", "inbound_nodes": [[["tf_op_layer_add_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["layer_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_3", "trainable": true, "dtype": "float32", "node_def": {"name": "add_3", "op": "AddV2", "input": ["layer_normalization_2/Identity", "dropout_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_3", "inbound_nodes": [[["layer_normalization_2", 0, 0, {}], ["dropout_4", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_3", "inbound_nodes": [[["tf_op_layer_add_3", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_3", 0, 0]]}, "name": "encoder_layer_1", "inbound_nodes": [[["encoder_layer_0", 1, 0, {}], ["padding_mask", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["encoder_layer_1", 1, 0]]}, "name": "encoder", "inbound_nodes": [[["inputs", 0, 0, {}], ["enc_padding_mask", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "look_ahead_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAUAAABDAAAAc0AAAAB0AGoBfACDAWQBGQB9AWQBdABqAmoDdABqBHwBfAFm\nAoMBZANkAoMDGAB9AnQFfACDAX0DdABqBnwCfAODAlMAKQRO6QEAAADpAAAAAOn/////KQfaAnRm\n2gVzaGFwZdoGbGluYWxn2gliYW5kX3BhcnTaBG9uZXPaE2NyZWF0ZV9wYWRkaW5nX21hc2vaB21h\neGltdW0pBNoBeNoHc2VxX2xlbtoPbG9va19haGVhZF9tYXNr2gxwYWRkaW5nX21hc2upAHIPAAAA\n+h48aXB5dGhvbi1pbnB1dC0xLTc4ZjZmNjNlYmExOD7aFmNyZWF0ZV9sb29rX2FoZWFkX21hc2ub\nAAAAcwgAAAAAAQ4BHgEIAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, null, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "look_ahead_mask", "inbound_nodes": [[["dec_inputs", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "dec_padding_mask", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAczQAAAB0AGoBdABqAmoDfABkAYMCdABqBIMCfQF8AWQAZACF\nAnQAagV0AGoFZABkAIUCZgQZAFMAKQJO6QAAAAApBtoCdGbaBGNhc3TaBG1hdGjaBWVxdWFs2gdm\nbG9hdDMy2gduZXdheGlzKQLaAXjaBG1hc2upAHIKAAAA+h48aXB5dGhvbi1pbnB1dC0xLTc4ZjZm\nNjNlYmExOD7aE2NyZWF0ZV9wYWRkaW5nX21hc2uWAAAAcwQAAAAAARgC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [1, 1, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "dec_padding_mask", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8333, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_1", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "mul_1", "op": "Mul", "input": ["embedding_1/Identity", "mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 16.0}}, "name": "tf_op_layer_mul_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "PositionalEncoding", "config": {"config": "as required"}, "name": "positional_encoding_1", "inbound_nodes": [[["tf_op_layer_mul_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["positional_encoding_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "decoder_layer_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention_1", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["look_ahead_mask", 0, 0, {}]}]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_4", "trainable": true, "dtype": "float32", "node_def": {"name": "add_4", "op": "AddV2", "input": ["attention_1_1/Identity", "inputs_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_4", "inbound_nodes": [[["attention_1", 0, 0, {}], ["inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_4", "inbound_nodes": [[["tf_op_layer_add_4", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention_2", "inbound_nodes": [{"query": ["layer_normalization_4", 0, 0, {}], "key": ["encoder_outputs", 0, 0, {}], "value": ["encoder_outputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["attention_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_5", "trainable": true, "dtype": "float32", "node_def": {"name": "add_5", "op": "AddV2", "input": ["dropout_6/Identity", "layer_normalization_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_5", "inbound_nodes": [[["dropout_6", 0, 0, {}], ["layer_normalization_4", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_5", "inbound_nodes": [[["tf_op_layer_add_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_7", "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_6", "trainable": true, "dtype": "float32", "node_def": {"name": "add_6", "op": "AddV2", "input": ["dropout_7/Identity", "layer_normalization_5/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_6", "inbound_nodes": [[["dropout_7", 0, 0, {}], ["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["tf_op_layer_add_6", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_6", 0, 0]]}, "name": "decoder_layer_0", "inbound_nodes": [[["dropout_5", 0, 0, {}], ["encoder_outputs", 0, 0, {}], ["look_ahead_mask", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "decoder_layer_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "look_ahead_mask"}, "name": "look_ahead_mask", "inbound_nodes": []}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention_1", "inbound_nodes": [{"query": ["inputs", 0, 0, {}], "key": ["inputs", 0, 0, {}], "value": ["inputs", 0, 0, {}], "mask": ["look_ahead_mask", 0, 0, {}]}]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_7", "trainable": true, "dtype": "float32", "node_def": {"name": "add_7", "op": "AddV2", "input": ["attention_1_2/Identity", "inputs_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_7", "inbound_nodes": [[["attention_1", 0, 0, {}], ["inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_outputs"}, "name": "encoder_outputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "padding_mask"}, "name": "padding_mask", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["tf_op_layer_add_7", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"config": "as required"}, "name": "attention_2", "inbound_nodes": [{"query": ["layer_normalization_7", 0, 0, {}], "key": ["encoder_outputs", 0, 0, {}], "value": ["encoder_outputs", 0, 0, {}], "mask": ["padding_mask", 0, 0, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_8", "inbound_nodes": [[["attention_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_8", "trainable": true, "dtype": "float32", "node_def": {"name": "add_8", "op": "AddV2", "input": ["dropout_8/Identity", "layer_normalization_7/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_8", "inbound_nodes": [[["dropout_8", 0, 0, {}], ["layer_normalization_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_8", "inbound_nodes": [[["tf_op_layer_add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_9", "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "add_9", "trainable": true, "dtype": "float32", "node_def": {"name": "add_9", "op": "AddV2", "input": ["dropout_9/Identity", "layer_normalization_8/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_add_9", "inbound_nodes": [[["dropout_9", 0, 0, {}], ["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_9", "inbound_nodes": [[["tf_op_layer_add_9", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["layer_normalization_9", 0, 0]]}, "name": "decoder_layer_1", "inbound_nodes": [[["decoder_layer_0", 1, 0, {}], ["encoder_outputs", 0, 0, {}], ["look_ahead_mask", 0, 0, {}], ["padding_mask", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["encoder_outputs", 0, 0], ["look_ahead_mask", 0, 0], ["padding_mask", 0, 0]], "output_layers": [["decoder_layer_1", 1, 0]]}, "name": "decoder", "inbound_nodes": [[["dec_inputs", 0, 0, {}], ["encoder", 1, 0, {}], ["look_ahead_mask", 0, 0, {}], ["dec_padding_mask", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "outputs", "trainable": true, "dtype": "float32", "units": 8333, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "outputs", "inbound_nodes": [[["decoder", 1, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["dec_inputs", 0, 0]], "output_layers": [["outputs", 0, 0]]}}, "training_config": {"loss": "loss_function", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "CustomSchedule", "config": {"warmup_steps": 4000}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9800000190734863, "epsilon": 1e-09, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "embedding_1/embeddings", "shape": [8333, 256], "dtype": "float32"}, {"name": "attention_1_1/dense_12/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_1/dense_12/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_1/dense_13/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_1/dense_13/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_1/dense_14/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_1/dense_14/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_1/dense_15/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_1/dense_15/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "attention_2/dense_16/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2/dense_16/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2/dense_17/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2/dense_17/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2/dense_18/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2/dense_18/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2/dense_19/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2/dense_19/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "attention_1_2/dense_22/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_2/dense_22/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_2/dense_23/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_2/dense_23/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_2/dense_24/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_2/dense_24/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1_2/dense_25/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1_2/dense_25/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_7/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_7/beta", "shape": [256], "dtype": "float32"}, {"name": "attention_2_1/dense_26/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2_1/dense_26/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2_1/dense_27/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2_1/dense_27/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2_1/dense_28/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2_1/dense_28/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_2_1/dense_29/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_2_1/dense_29/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_30/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_30/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_31/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_31/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [8333, 256], "dtype": "float32"}, {"name": "attention/dense/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention/dense/bias", "shape": [256], "dtype": "float32"}, {"name": "attention/dense_1/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention/dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "attention/dense_2/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention/dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "attention/dense_3/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention/dense_3/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "attention_1/dense_6/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1/dense_6/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1/dense_7/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1/dense_7/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1/dense_8/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1/dense_8/bias", "shape": [256], "dtype": "float32"}, {"name": "attention_1/dense_9/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "attention_1/dense_9/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_2/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_3/beta", "shape": [256], "dtype": "float32"}, {"name": "outputs/kernel", "shape": [256, 8333], "dtype": "float32"}, {"name": "outputs/bias", "shape": [8333], "dtype": "float32"}]}]}